"SPC Password" = "Contrasenya SPC";
"Authentication Key" = "Clau d'autenticació";
"Incorrect key" = "Clau incorrecta";
"Incorrect SPC Password" = "Contrasenya SPC incorrecta";
"Enter 26 digit key" = "Escriviu una clau d'autenticació de 26 dígits.";
"Security" = "Seguretat";
"Too many retries of SPC." = "S'ha intentat introduir l'SPC.";
"AKEY set successfully." = "AKEY definida correctament.";
"Failed to set AKEY." = "No s'ha pogut definir l'AKEY.";
"Too many retries of AKEY." = "S'ha intentat introduir l'AKEY massa vegades.";
"Password" = "Contrasenya";
"Key" = "Clau";
"OK" = "Acceptar";
"Cancel" = "Cancel·lar";